---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Getting_Started_Using_the_Autodesk_Revit_API_Deployment_Options_html
author:
---

# Help | Revit API Developers Guide | Autodesk

> ## Excerpt
> This API Developer's Guide describes how to use the application programming interface (API) for Autodesk Revit.

---
This API Developer's Guide describes how to use the application programming interface (API) for Autodesk Revit.

-   Dynamo

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_html
author:
---

# Help | Introduction | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Getting_Started_html
author:
---

# Help | Getting Started | Autodesk

> ## Excerpt
> The Revit Platform API is fully accessible by any language compatible with the Microsoft .NET Framework 4.8, such as Visual C# or Visual Basic .NET (VB.NET). Both Visual C# and VB.NET are commonly used to develop Revit Platform API applications. However, the focus of this manual is developing applications using Visual C#.

---
The Revit Platform API is fully accessible by any language compatible with the Microsoft .NET Framework 4.8, such as Visual C# or Visual Basic .NET (VB.NET). Both Visual C# and VB.NET are commonly used to develop Revit Platform API applications. However, the focus of this manual is developing applications using Visual C#.

**Pages in this section**

-   Welcome to the Revit Platform API
-   Using the Autodesk Revit API
-   Walkthroughs
-   Walkthrough: Hello World
-   Walkthrough: Add Hello World Ribbon Panel
-   Walkthrough: Retrieve Selected Elements
-   Walkthrough: Retrieve Filtered Elements

**Parent page:** Introduction

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Getting_Started_Welcome_to_the_Revit_Platform_API_html
author:
---

# Help | Welcome to the Revit Platform API | Autodesk

> ## Excerpt
> All Autodesk Revit-based products are Parametric Building Information Modeling (BIM) tools. Such a tool can be looked at as a CAD program that is used to build a 3D model rather than a set of individual drawing files. Autodesk Revit modeling is accomplished with real-world elements like columns, walls, doors and windows. The user can create views of the model, including plans, sections and callouts. All these views are directly generated from the 3D physical model so changes made in one view will automatically propagate through all other views. This process virtually eliminates the need to update multiple drawings and details when a change is made in the model.

---
All Autodesk Revit-based products are Parametric Building Information Modeling (BIM) tools. Such a tool can be looked at as a CAD program that is used to build a 3D model rather than a set of individual drawing files. Autodesk Revit modeling is accomplished with real-world elements like columns, walls, doors and windows. The user can create views of the model, including plans, sections and callouts. All these views are directly generated from the 3D physical model so changes made in one view will automatically propagate through all other views. This process virtually eliminates the need to update multiple drawings and details when a change is made in the model.

The Autodesk Revit API is designed to reflect the same user interaction paradigms as the program's Graphical User Interface. Therefore, the first step to understanding the API is to learn how to use the program. If you are an Autodesk Revit novice, we suggest you first start by going through the Tutorials which you can access through the program's Help menu. You may also find it helpful to take a Training class from your local Autodesk reseller. This will help you quickly get up to speed with the program

Autodesk Resources:

-   http://www.autodesk.com/products/autodesk-revit-family/overview
-   http://www.autodesk.com/bim/
-   http://forums.autodesk.com/t5/Revit-API/bd-p/160

External Resources:

-   http://www.revitcity.com/
-   http://forums.augi.com/forumdisplay.php?93-Revit
-   http://www.revitinside.com/

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Getting_Started_Using_the_Autodesk_Revit_API_html
author:
---

# Help | Using the Autodesk Revit API | Autodesk

> ## Excerpt
> The Autodesk Revit API Software Development Kit (SDK) is installed from the Tools and Utilities section of the Autodesk Revit installation. In the SDK, there are example files that will help you get a better understanding of the API and its use. Each example file has a sample .addin manifest file with the information that you will need to edit and place into the appropriate folder, which Autodesk Revit will access on launch.

---
## Autodesk Revit SDK and Online Help

The Autodesk Revit API Software Development Kit (SDK) is installed from the Tools and Utilities section of the Autodesk Revit installation. In the SDK, there are example files that will help you get a better understanding of the API and its use. Each example file has a sample .addin manifest file with the information that you will need to edit and place into the appropriate folder, which Autodesk Revit will access on launch.

RevitAPI.chm is the Autodesk Revit API reference documentation help chm file, included with the SDK package in the \\Revit 2018 SDK\\ folder.

**For more information:**

-   Glossary of Autodesk Revit Terms
-   FAQ

**Resources:**

-   www.autodesk.com/adn - Autodesk Developer Network home (ADN)

-   www.autodesk.com/developrevit - Autodesk Revit development resources

-   http://forums.autodesk.com/t5/Revit-API/bd-p/160 - Revit API discussion group

-   http://thebuildingcoder.typepad.com/blog/ - The Building Coder, an ADN blog dedicated to Revit coding

-   http://bimapps.typepad.com/ - Bim Apps, a blog dedicated to BIM applications

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Getting_Started_Walkthroughs_html
author:
---

# Help | Walkthroughs | Autodesk

> ## Excerpt
> If you are new to the Revit Platform API, the following topics are good starting points to help you understand the product. Walkthroughs provide step-by-step instructions for common scenarios, helping you learn about the product or a particular feature. The following walkthroughs will help you get started using the Revit Platform API:

---
If you are new to the Revit Platform API, the following topics are good starting points to help you understand the product. Walkthroughs provide step-by-step instructions for common scenarios, helping you learn about the product or a particular feature. The following walkthroughs will help you get started using the Revit Platform API:

Walkthrough: Hello World - Illustrates how to create an add-in using the Revit Platform API.

Walkthrough: Add Hello World Ribbon Panel - Illustrates how to add a custom ribbon panel.

Walkthrough: Retrieve Selected Elements - Illustrates how to retrieve selected elements.

Walkthrough: Retrieve Filtered Elements - Illustrates how to retrieve elements based on filter criteria.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Add_In_Integration_html
author:
---

# Help | Add-In Integration | Autodesk

> ## Excerpt
> Developers add functionality by creating and implementing External Commands and External Applications. Revit identifies the new commands and applications using .addin manifest files.

---
Developers add functionality by creating and implementing External Commands and External Applications. Revit identifies the new commands and applications using .addin manifest files.

-   External Commands appear under the External Tools menu-button on the Add-Ins tab.
-   External Applications are invoked when Revit starts up and unloaded when Revit shuts down

This chapter focuses on the following:

-   Learning how to add functionality using External Commands and External Applications.
-   How to access Revit events.
-   How to customize the Revit UI.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Add_In_Integration_Digitally_Signing_Your_Revit_Add_in_html
author:
---

# Help | Digitally Signing Your Revit Add-in | Autodesk

> ## Excerpt
> Revit checks security credentials of add-ins.

---
Revit checks security credentials of add-ins.

If an add-in is not digitally signed with a certificate issued by a trusted certificate authority, Revit pops up a dialog when opening asking the user to confirm if he/she wants to load the application. The figure below shows an example of the security warning dialog when an unsigned add-in is detected. The user is presented with choices of: 1) allowing the same add-in to always load from now on, 2) load only this time and ask again next time, and 3) do not allow to load the add-in.

If you are professional developer and your application is already digitally signed by a trusted certificate authority, your add-in is already compatible with the digital signature checking in Revit. The following sections are intended for developers who author add-ins, but who are not familiar with digital signing in Revit.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Application_and_Document_html
author:
---

# Help | Application and Document | Autodesk

> ## Excerpt
> The top level objects in the Revit Platform API are application and document. These are represented by the classes Application, UIApplication, Document and UIDocument.

---
The top level objects in the Revit Platform API are application and document. These are represented by the classes Application, UIApplication, Document and UIDocument.

-   The application object refers to an individual Revit session, providing access to documents, options, and other application-wide data and settings.
    -   Autodesk.Revit.UI.UIApplication - provides access to UI-level interfaces for the application, including the ability to add RibbonPanels to the user interface, and the ability to obtain the active document in the user interface.
    -   Autodesk.Revit.ApplicationServices.Application - provides access to all other application level properties.
-   The document object is a single Revit project file representing a building model. Revit can have multiple projects open and multiple views for one project.
    -   Autodesk.Revit.UI.UIDocument - provides access to UI-level interfaces for the document, such as the contents of the selection and the ability to prompt the user to make selections and pick points
    -   Autodesk.Revit.DB.Document - provides access to all other document level properties
-   If multiple documents are open, the active document is the one whose view is active in the Revit session.

This chapter identifies all Application and Document functions, and then focuses on file management, settings, and units. For more details about the Element class, refer to Elements Essentialss and Editing Elements and refer to the Views for more details about the view elements.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Application_and_Document_Application_Functions_html
author:
---

# Help | Application Functions | Autodesk

> ## Excerpt
> Application and UIApplication members provide access to application-wide data and settings as well as the active session of Revit.

---
Application and UIApplication members provide access to application-wide data and settings as well as the active session of Revit.

## Application

The class represents the Autodesk Revit Application, providing access to documents, options and other application wide data and settings.

### Application Version Information

Application properties include VersionBuild, VersionNumber and VersionName. These can be used to provide add-in behavior based on the release and build of Revit, as shown in How to use Application properties to enforce a correct version for your add-in.

#### Application-wide Settings

##### Shared Parameters

Revit uses one shared parameter file at a time. The Application.OpenSharedParameterFile() method accesses the shared parameter file whose path is set in the SharedParametersFilename property. For more details, see Shared Parameters.

##### Library Content

The GetLibraryPaths() and SetLibraryPaths() methods provide access to the path information identifying where Revit searches for content .

##### Graphical Display

The BackgroundColor property allows read and write of the background color to use for model views in this session. The AllowNavigationDuringRedraw property enables or disables the option to allow view manipulation during redraw. This can be used to optimize performance during a redraw of the model.

#### Document Management

The Application class provides methods to create the following types of documents:

-   Family document
-   Project document
-   Project template

The OpenDocumentFile() method can be used to open any of these document types.

All open documents can be retrieved using the Documents property.

For more details, see Document and File Management.

#### Session Information

Properties such as UserName and methods such as GetRevitServerNetworkHosts() provide read-only access to this session specific information.

#### Login Information

The static IsLoggedIn property checks if the user is logged in from this session to their Autodesk A360 account. If they are logged in, the LoginUserId property will return the user id of the user currently logged in. (The user id will be empty if the user is not logged in.) Unlike the UserName from the section above, the LoginUserId value is not a recognizable value, but an internal id. In conjunction with the Store Entitlement REST API, a publisher of an Autodesk app can verify if the current user has purchased their app from the Autodesk App Store. For more information about Store Entitlement API, please refer to www.autodesk.com/developapps.

#### Shared Parameter Management

#### Events

The Application class exposes document and application events such as document open and save. Subscribing to these events notifies the application when the events are enabled and acts accordingly. For more details, see Events in the Add-In Integration section.

#### Create

The Create property returns an Object Factory used to create application-wide utility and geometric objects in the Revit Platform API. Create is used when you want to create an object in the Revit application memory rather than your application's memory.

#### Failure Posting and Handling

The FailureDefinitionRegistry, which contains all registered FailureDefinitions is available from the static GetFailureDefinitionRegistry() method. The static method RegisterFailuresProcessor() can be used to register a custom IFailuresProcessor. For more information on posting and handling failures, see Failure Posting and Handling.

#### Disconnect Warnings

The following properties control whether or not to show the graphical warnings for various types of disconnects.

-   ShowGraphicalWarningCableTrayConduitDisconnects
-   ShowGraphicalWarningDuctDisconnects
-   ShowGraphicalWarningElectricalDisconnects
-   ShowGraphicalWarningHangerDisconnects
-   ShowGraphicalWarningPipeDisconnects

### UIApplication

This class represents an active session of the Autodesk Revit user interface, providing access to UI customization methods, events, and the active document.

#### UI Document Management

The UIApplication provides access to the active document using the UIActiveDocument property. Additionally, a Revit document may be opened using the overloaded OpenAndActivateDocument() method. The document will be opened with the default view active. This method may not be called inside a transaction and may only be invoked during an event when no active document is open yet in Revit and the event is not nested inside another event.

#### Add-in Management

The ActiveAddInId property gets the current active external application or external command id, while the LoadedApplications property returns an array of successfully loaded external applications.

#### Ribbon Panel Utility

Use the UIApplication object to add new ribbon panels and controls to Revit.

For more details, see Ribbon Panel and Controls in the Add-In Integration section.

#### Extents

The DrawingAreaExtents property returns a rectangle that represents the screen pixel coordinates of drawing area, while the MainWindowExtents property returns the rectangle that represents the screen pixel coordinates of the Revit main window

#### UI Events

The UIApplication class exposes UI related events such as when a dialog box is displayed. Subscribing to these events notifies the application when the events are enabled and acts accordingly. For more details, see Events in the Add-In Integration section.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Application_and_Document_Document_Functions_html
author:
---

# Help | Document Functions | Autodesk

> ## Excerpt
> Document stores the Revit Elements, manages the data, and updates multiple data views. The Document class mainly provides the following functions.

---
Document stores the Revit Elements, manages the data, and updates multiple data views. The Document class mainly provides the following functions.

## Document

The Document class represents an open Autodesk Revit project.

### Settings Property

The Settings property returns an object that provides access to general components within Revit projects. For more details, see Settings.

### Place and Locations

Each project has only one site location that identifies the physical project location on Earth. There can be several project locations for one project. Each location is an offset, or rotation, of the site location. For more details, see Place and Locations.

### View Management

A project document can have multiple views. The ActiveView property returns a View object representing the active view. You can filter the elements in the project to retrieve other views. For more details, see Views.

### Element Retrieval

The Document object stores elements in the project. Retrieve specific elements by ElementId or UniqueId using the Element property.

For more details, see Elements Essentials.

### File Management

Each Document object represents a Revit project file. Document provides the following functions:

-   Retrieve file information such as file path name and project title.
-   Provides Close() and Save() methods to close and save the document.

For more details, see Document and File management.

### Element Management

Revit maintains all Element objects in a project. To create new elements, use the Create property which returns an Object Factory used to create new project element instances in the Revit Platform API, such as FamilyInstance or Group.

The Document class can also be used to delete elements. Use the Delete() method to delete an element in the project. Deleted elements and any dependent elements are not displayed and are removed from the Document. References to deleted elements are invalid and cause an exception. For more details, see Editing Elements.

### Events

Events are raised on certain actions, such as when you save a project using Save or Save As. To capture the events and respond in the application, you must register the event handlers. For more details, see Events.

### Document Status

Several properties provide information on the status of the document:

-   IsModifiable - whether the document may currently be modified (meaning that is there is an active transaction in the document and changes are not temporarily blocked by anything else)
-   IsModified - whether the document was changed since it was opened or saved
-   IsReadOnly - if true, the document is currently read-only and cannot be modified
-   IsReadOnlyFile - whether the document was opened in read-only mode
-   IsFamilyDocument - whether the document is a family document
-   IsWorkshared - whether worksets have been enabled in the document

### Others

Document also provides other functions:

-   ParameterBindings Property - Mapping between parameter definitions and categories. For more details, see Shared Parameters.
-   ReactionsAreUpToDate Property - Reports whether the reactionary loads changed. For more details, see Loads.
-   Default Types - Access to the default types for family and non-family elements. For more details, see Default Types.

## UIDocument

The UIDocument class represents an Autodesk Revit project opened in the Revit user interface.

### Element Retrieval in UIDocument

Retrieve selected elements using the Selection property in UIDocument. This property returns an object representing the active selection containing the selected project elements. It also provides UI interaction methods to pick objects in the Revit model.

For more details, see Elements Essentials.

### Element Display

The ShowElements() method uses zoom to fit to focus in on one more elements.

### View Management in UIDocument

The UIDocument class can be used to refresh the active view in the active document by calling the RefreshActiveView() method. The ActiveView property can be used to retrieve or set the active view for the document. Changing the active view has some restrictions. It can only be used in an active document, which must not be in read-only state and must not be inside a transaction. Additionally, the active view may not be changed during the ViewActivating or ViewActivated event, or during any pre-action event, such as DocumentSaving, DocumentClosing, or other similar events.

The UIDocument.ActiveGraphicalView property retrieves the active graphical view for the document. Unlike UIDocument.ActiveView, this property will never return auxiliary views like the Project Browser or System Browser if the user has happened to make a selection in one of those views.

The UIDocument can also be used to get a list of all open view windows in the Revit user interface. The GetOpenUIViews method returns a list of UIViews which contain data about the view windows in the Revit user interface.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Elements_Essentials_html
author:
---

# Help | Elements Essentials | Autodesk

> ## Excerpt
> An Element corresponds to a single building or drawing component, such as a door, a wall, or a dimension. In addition, an Element can be a door type, a view, or a material definition.

---
An Element corresponds to a single building or drawing component, such as a door, a wall, or a dimension. In addition, an Element can be a door type, a view, or a material definition.

**Pages in this section**

-   Element Classification
-   Other Classifications
-   Element Retrieval
-   General Properties

**Parent page:** Introduction

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_html
author:
---

# Help | Basic Interaction with Revit Elements | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Filtering_html
author:
---

# Help | Filtering | Autodesk

> ## Excerpt
> The Revit API provides a mechanism for filtering and iterating elements in a Revit document. This is the best way to get a set of related elements, such as all walls or doors in the document. Filters can also be used to find a very specific set of elements, such as all beams of a specific size.

---
The Revit API provides a mechanism for filtering and iterating elements in a Revit document. This is the best way to get a set of related elements, such as all walls or doors in the document. Filters can also be used to find a very specific set of elements, such as all beams of a specific size.

The basic steps to get elements passing a specified filter are as follows:

1.  Create a new FilteredElementCollector
2.  Apply one or more filters to it
3.  Get filtered elements or element ids (using one of several methods)

The following sample covers the basic steps to filtering and iterating elements in the document.

<table summary="" id="GUID-85E4A43E-88B5-43C6-908C-2D138C9F611D__TABLE_9B881B8A742C4C1885A86B5BE0CEFA42"><tbody><tr><td><b>Code Region 6-1: Use element filtering to get all wall instances in document</b></td></tr><tr><td><pre><code><span>// Find all Wall instances in the document by using category filter</span><span>
</span><span>public</span><span> </span><span>void</span><span> </span><span>GetAllWalls</span><span>(</span><span>Document</span><span> document</span><span>)</span><span>
</span><span>{</span><span>
    </span><span>ElementCategoryFilter</span><span> filter </span><span>=</span><span> </span><span>new</span><span> </span><span>ElementCategoryFilter</span><span>(</span><span>BuiltInCategory</span><span>.</span><span>OST_Walls</span><span>);</span><span>

    </span><span>// Apply the filter to the elements in the active document</span><span>
    </span><span>// Use shortcut WhereElementIsNotElementType() to find wall instances only</span><span>
    </span><span>FilteredElementCollector</span><span> collector </span><span>=</span><span> </span><span>new</span><span> </span><span>FilteredElementCollector</span><span>(</span><span>document</span><span>);</span><span>
    </span><span>IList</span><span>&lt;</span><span>Element</span><span>&gt;</span><span> walls </span><span>=</span><span> collector</span><span>.</span><span>WherePasses</span><span>(</span><span>filter</span><span>).</span><span>WhereElementIsNotElementType</span><span>().</span><span>ToElements</span><span>();</span><span>
    </span><span>String</span><span> prompt </span><span>=</span><span> </span><span>"The walls in the current document are:\n"</span><span>;</span><span>
    </span><span>foreach</span><span> </span><span>(</span><span>Element</span><span> e </span><span>in</span><span> walls</span><span>)</span><span>
    </span><span>{</span><span>
            prompt </span><span>+=</span><span> e</span><span>.</span><span>Name</span><span> </span><span>+</span><span> </span><span>"\n"</span><span>;</span><span>
    </span><span>}</span><span>
    </span><span>TaskDialog</span><span>.</span><span>Show</span><span>(</span><span>"Revit"</span><span>,</span><span> prompt</span><span>);</span><span>
</span><span>}</span></code></pre></td></tr></tbody></table>

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Selection_html
author:
---

# Help | Selection | Autodesk

> ## Excerpt
> You can get the selected objects from the current active document using the UIDocument.Selection.GetElementIds() method which returns a collection fo ElementIds of the selected elements. The collection returned by this method can be used directly with FilteredElementCollector to filter the selected elements.

---
You can get the selected objects from the current active document using the UIDocument.Selection.GetElementIds() method which returns a collection fo ElementIds of the selected elements. The collection returned by this method can be used directly with FilteredElementCollector to filter the selected elements.

The Selection object can also be used to change the current selection programmatically using the SetElementIds() method.

**Pages in this section**

-   Changing the Selection
-   User Selection
-   Filtered User Selection

**Parent page:** Basic Interaction with Revit Elements

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Parameters_html
author:
---

# Help | Parameters | Autodesk

> ## Excerpt
> Revit provides a general mechanism for giving each element a set of parameters that you can edit.

---
Revit provides a general mechanism for giving each element a set of parameters that you can edit.

In the Revit UI, some element parameters are visible in the Element Properties Palette. The following sections describe how to get and use built-in parameters, shared parameters and global parameters.

In the Revit Platform API, Parameters are managed in the Element class. You can access Parameters in these ways:

Common ways to get the value of a parameter are shown below. In this sample, all three lines of code get the same parameter. Because this parameter is stored as a string, the `AsString()` method is used to get its value.

```
private void GetStringParameterValue(Wall wall)
{
    string s1 = wall.LookupParameter("Comments").AsString();
    string s2 = wall.GetParameter(ParameterTypeId.AllModelInstanceComments).AsString();
    string s3 = wall.get_Parameter(BuiltInParameter.ALL_MODEL_INSTANCE_COMMENTS).AsString();
}
```

Other ways to get a parameter are:

-   By iterating through the Element.Parameters collection of all parameters for an Element (for an example, see the sample code in Walkthrough Get Selected Element Parameters).
-   By iterating through the collection returned by Element.GetOrderedParameters(), which returns only parameters visible in the Properties Palette.
-   By accessing a parameter by name via the Element.ParametersMap collection or Element.GetParameters()

You can retrieve the Parameter object from an Element using the overloaded Parameter property if you know the built-in ID, definition, or GUID. The Parameter\[GUID\] property overload gets a shared parameter based on its Global Unique ID (GUID), which is assigned to the shared parameter when it's created.

The Element.LookupParameter() method gets a parameter based on its localized name, so your code should handle different languages if it's going to look up parameters by name and needs to run in more than one locale. Also, keep in mind that multiple matches of parameters with the same name can occur because shared parameters or project parameters can be bound to an element category even if there is already a built-in parameter with the same name. For this reason, it is better to use Element.GetParameters() which will return all parameters matching the given name. Element.LookupParameter() will return the first match found.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Parameters_Shared_Parameters_html
author:
---

# Help | Shared Parameters | Autodesk

> ## Excerpt
> Shared Parameters are parameter definitions stored in an external text file.

---
Shared Parameters are parameter definitions stored in an external text file.

The definitions are identified by a unique identifier generated when the definition is created and can be used in multiple projects.

The main objects associated with shared parameters are:

-   DefinitionFile - represents a shared parameters file on disk
-   DefinitionGroup - group of shared parameters which are organized into meaningful sets
-   ExternalDefinition - represents a shared parameter definition, belongs to a DefinitionGroup
-   ExternalDefinitions - supports the creation of new shared parameters definitions
-   Binding - binds a parameter definition to one or more categories
-   BindingMap - contains all the parameter bindings that exist in the Autodesk Revit project
-   ParameterElement - stores information about a particular user-defined parameter in the document
-   SharedParameterElement - derived from ParameterElement, stores the definition of a shared parameter The following sections describe how to gain access to shared parameter definitions through the Revit Platform API, including how to get a shared parameter definition and bind it to Elements in certain Categories.

To access Shared Parameters after they are defined and bound to categories, see Parameters.

## Clearing the value of a parameter

`Parameter.ClearValue()` resets the value of a shared parameter with the HideWhenNoValue flag to a cleared state. This method is not applicable to clear the value of any other parameter type.

### Hiding empty parameters

The property `ExternalDefinition.HideWhenNoValue` indicates if the shared parameter should be hidden from the property palette and `Element.GetOrderedParameters()` when it has no value.

This can be set when creating a shared parameter by setting `ExternalDefinitionCreationOptions.HideWhenNoValue` There is also `SharedParameterElement.ShouldHideWhenNoValue()`

### Filtering by presence or absence of parameter value

These filter classes define filter rules evaluating whether or not a parameter has a value for a specific element:

-   ParameterValuePresenceRule
-   HasValueFilterRule
-   HasNoValueFilterRule

These static methods create an instance of these rules for use in a parameter filter.:

-   FilterRule.CreateHasValueParameterRule()
-   FilterRule.CreateHasNoValueParameterRule()

In schedules, use these new enumerated values with the method `ScheduleDefinition.CanFilterByValuePresence()` to filter based on the presence or absence of a value assigned to that parameter:

-   ScheduleFilterType.HasValue
-   ScheduleFilterType.HasNoValue

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Parameters_Global_Parameters_html
author:
---

# Help | Global Parameters | Autodesk

> ## Excerpt
> Global parameters support controlling geometry constraints through special parameters defined in a project document.

---
Global parameters support controlling geometry constraints through special parameters defined in a project document.

Global Parameters can be used for both labeling and reporting to/from dimensions, as well as setting values of instance parameters. They can be used to drive values of dimensions or other elements' parameters and they can be driven by a selected dimension, the value of which then determines the value of the global parameter.

**Pages in this section**

-   Managing Global Parameters
-   GlobalParameter Basics
-   Reporting vs. Non-Reporting parameters
-   Formulas and Global Parameters
-   Labeling Dimensions with Global Parameters

**Parent page:** Parameters

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Collections_html
author:
---

# Help | Collections | Autodesk

> ## Excerpt
> Most Revit Platform API properties and methods use .NET Framework collection classes when providing access to a group of related items.

---
Most Revit Platform API properties and methods use .NET Framework collection classes when providing access to a group of related items.

The IEnumerable and IEnumerator interfaces implemented in Revit collection types are defined in the System.Collection namespace.

**Pages in this section**

-   Interface
-   Collections and Iterators

**Parent page:** Basic Interaction with Revit Elements

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Editing_Elements_html
author:
---

# Help | Editing Elements | Autodesk

> ## Excerpt
> In Revit, you can move, copy, rotate, align, delete, mirror, group, and array one element or a set of elements with the Revit Platform API. Using the editing functionality in the API is similar to the commands in the Revit UI.

---
In Revit, you can move, copy, rotate, align, delete, mirror, group, and array one element or a set of elements with the Revit Platform API. Using the editing functionality in the API is similar to the commands in the Revit UI.

**Pages in this section**

-   Moving Elements
-   Copying Elements
-   Rotating elements
-   Aligning Elements
-   Mirroring Elements
-   Grouping Elements
-   Creating Arrays of Elements
-   Deleting Elements
-   Pinned Elements

**Parent page:** Basic Interaction with Revit Elements

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Views_html
author:
---

# Help | Views | Autodesk

> ## Excerpt
> Views are images produced from a Revit model with privileged access to the data stored in the documents. They can be graphics, such as plans, or text, such as schedules. Each project document has one or more different views. The last focused window is the active view.

---
Views are images produced from a Revit model with privileged access to the data stored in the documents. They can be graphics, such as plans, or text, such as schedules. Each project document has one or more different views. The last focused window is the active view.

The Autodesk.Revit.DB.View class is the base class for all view types in the Revit document. The Autodesk.Revit.UI.UIView class represents the window view in the Revit user interface.

In the following sections, you learn how views are generated, the types of views supported by Revit, the features for each view, as well as the functionality available for view windows in the user interface.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Views_View_Types_html
author:
---

# Help | View Types | Autodesk

> ## Excerpt
> Different types of Revit views are represented by different classes in the Revit API. See the following topics for more information on each type of view.

---
Different types of Revit views are represented by different classes in the Revit API. See the following topics for more information on each type of view.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Views_View_Types_TableView_html
author:
---

# Help | TableView | Autodesk

> ## Excerpt
> This class represents a view that shows a table of data.

---
This class represents a view that shows a table of data.

TableView is the base class for ViewSchedule and PanelScheduleView.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Views_View_Types_TableView_ViewSchedule_html
author:
---

# Help | ViewSchedule | Autodesk

> ## Excerpt
> A schedule is a tabular representation of data. A typical schedule shows all elements of a category (doors, rooms, etc.) with each row representing an element and each column representing a parameter.

---
A schedule is a tabular representation of data. A typical schedule shows all elements of a category (doors, rooms, etc.) with each row representing an element and each column representing a parameter.

The ViewSchedule class represents schedules and other schedule-like views, including single-category and multi-category schedules, key schedules, material takeoffs, view lists, sheet lists, keynote legends, revision schedules, and note blocks.

The ViewSchedule.Export() method will export the schedule data to a text file.

TableData.ZoomLevel allows the user to set the zoom level of a schedule in a tabular view. This setting will not change the size of text, rows, or columns in a sheet view. Additionally, the setting is temporary and only applies to the current session.

## Placing Schedules on Sheets

The static ScheduleSheetInstance.Create() method creates an instance of a schedule on a sheet. It requires the ID of the sheet where the schedule will be placed, the ID of the schedule view, and the XYZ location on the sheet where the schedule will be placed. The ScheduleSheetInstance object has properties to access the ID of the "primary" schedule that generates this ScheduleSheetInstance, the rotation of the schedule on the sheet, the location on the sheet where the schedule is placed (in sheet coordinates), as well as a flag that identifies if the ScheduleSheetInstance is a revision schedule in a titleblock family.

The `GetScheduleHeightsOnSheet` method returns the height of the column headers, row heights, and schedule title.

## Striped rows

These properties provide access to read or set if a given schedule is using a striped row display, and whether that display will be used on a sheet that displays this schedule:

-   ViewSchedule.HasStripedRows
-   ViewSchedule.UseStripedRowsOnSheets

These methods get and set the color applied to the indicated part of the pattern for a schedule with striped rows:

-   ViewSchedule.GetStripedRowsColor()
-   ViewSchedule.SetStripedRowsColor()

`ViewSchedule.IsHeaderFrozen` provides access to read or set if the header is frozen on a given schedule.

## Split Schedules

Schedules can be split, and the resulting segments can be split, merged, and deleted. An overload of `ScheduleSheetInstance.Create` exists to place a schedule segment on a sheet.

## Filtering By Sheet

With the `ScheduleDefinition.IsFilteredBySheet` property, you can define if the `ScheduleSheetInstance` will list only the elements visible in the viewports on that sheet.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Basic_Interaction_with_Revit_Elements_Transactions_html
author:
---

# Help | Transactions | Autodesk

> ## Excerpt
> Transactions are context-like objects that encapsulate any changes to a Revit model. Any change to a document can only be made while there is an active transaction open for that document. Attempting to change the document outside of a transaction will throw an exception. Changes do not become a part of the model until the active transaction is committed. Consequently, all changes made in a transaction can be rolled back either explicitly or implicitly (by the destructor). Only one transaction per document can be open at any given time. A transaction may consist of one or more operations.

---
Transactions are context-like objects that encapsulate any changes to a Revit model. Any change to a document can only be made while there is an active transaction open for that document. Attempting to change the document outside of a transaction will throw an exception. Changes do not become a part of the model until the active transaction is committed. Consequently, all changes made in a transaction can be rolled back either explicitly or implicitly (by the destructor). Only one transaction per document can be open at any given time. A transaction may consist of one or more operations.

There are three main classes in the Revit API related to transactions:

-   Transaction

-   SubTransaction

-   TransactionGroup

This section will discuss each of these classes in more depth. Only the Transaction class is required to make changes to a document. The other classes can be used to better organize changes.

Note: An exception will be thrown if a transaction is started from an outside thread or outside modeless dialog. Transactions can only be started from supported API workflows, such as part of an external command, event, updater, or call-back.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_html
author:
---

# Help | Revit Geometric Elements | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Walls_Floors_Ceilings_Roofs_and_Openings_html
author:
---

# Help | Walls, Floors, Ceilings, Roofs and Openings | Autodesk

> ## Excerpt
> Elements and the corresponding ElementTypes representing built-in place construction.

---
Elements and the corresponding ElementTypes representing built-in place construction.

The following sections cover the classes associated with built-in place construction such as walls, floors, ceilings, roofs and openings and their corresponding properties.

**Pages in this section**

-   Walls
-   Floors, Ceilings and Foundations
-   Roofs
-   Curtains
-   Other Elements
-   CompoundStructure
-   Opening
-   Thermal Properties

**Parent page:** Revit Geometric Elements

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Family_Instances_html
author:
---

# Help | Family Instances | Autodesk

> ## Excerpt
> In this section, you will learn about the following:

---
In this section, you will learn about the following:

-   The relationship between family and family instance
-   Family and family instance features
-   How to load or create family and family instance features
-   The relationship between family instance and family symbol

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Family_Documents_html
author:
---

# Help | Family Documents | Autodesk

> ## Excerpt
> This section discusses families and how to:

---
This section discusses families and how to:

-   Create and modify Family documents
-   Access family types and parameters

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Family_Documents_Creating_elements_in_families_html
author:
---

# Help | Creating elements in families | Autodesk

> ## Excerpt
> Share

---
Share

The FamilyItemFactory class provides the ability to create elements in family documents. It is accessed through the Document.FamilyCreate property. FamilyItemFactory is derived from the ItemFactoryBase class which is a utility to create elements in both Revit project documents and family documents.

**Pages in this section**

-   Create a form element
-   Create an annotation

**Parent page:** Family Documents

### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Conceptual_Design_html
author:
---

# Help | Conceptual Design | Autodesk

> ## Excerpt
> This chapter discusses the conceptual design functionality of the Revit API for the creation of complex geometry in a family document. Form-making is supported by the addition of new objects: points and spline curves that pass through these points. The resulting surfaces can be divided, patterned, and panelized to create buildable forms with persistent parametric relationships.

---
This chapter discusses the conceptual design functionality of the Revit API for the creation of complex geometry in a family document. Form-making is supported by the addition of new objects: points and spline curves that pass through these points. The resulting surfaces can be divided, patterned, and panelized to create buildable forms with persistent parametric relationships.

**Pages in this section**

-   Point and curve objects
-   Forms
-   Rationalizing a Surface
-   Adaptive Components
-   Create a .addin manifest file

**Parent page:** Revit Geometric Elements

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Datum_and_Information_Elements_html
author:
---

# Help | Datum and Information Elements | Autodesk

> ## Excerpt
> This chapter introduces Datum Elements and Information Elements in Revit.

---
This chapter introduces Datum Elements and Information Elements in Revit.

-   Datum Elements include levels, grids, and ModelCurves.
-   Information Elements include phases, design options, and EnergyDataSettings.

For more information about Revit Element classifications, refer to Elements Essentials.

If you need more information, refer to the related chapter:

-   For LoadBase, LoadCase, LoadCombination, LoadNature and LoadUsage, refer to Structural Engineering
-   For ModelCurve, refer to Sketching
-   For Material and FillPattern, refer to Material
-   For EnergyDataSettings, refer to Energy Data

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Annotation_Elements_html
author:
---

# Help | Annotation Elements | Autodesk

> ## Excerpt
> This section covers Revit Annotation Elements, such as dimensions, text notes, keynotes, tags, and symbols.

---
This section covers Revit Annotation Elements, such as dimensions, text notes, keynotes, tags, and symbols.

Note that:

-   Dimensions are view-specific elements that display sizes and distances in a project.
-   Detail curves are created for detailed drawings. They are visible only in the view in which they are drawn. Often they are drawn over the model view.
-   Tags are an annotation used to identify elements in a drawing. Properties associated with a tag can appear in schedules.
-   AnnotationSymbol has multiple leader options when loaded into a project.

For more information about Revit Element classification, refer to Elements Essentials.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Geometry_html
author:
---

# Help | Geometry | Autodesk

> ## Excerpt
> The Autodesk.Revit.DB namespace contains many classes related to geometry and graphic-related types used to describe the graphical representation in the API. The geometry-related classes include:

---
The Autodesk.Revit.DB namespace contains many classes related to geometry and graphic-related types used to describe the graphical representation in the API. The geometry-related classes include:

-   GeometryObject class - Includes classes derived from the GeometryObject class.
-   Geometry Helper Classes - Includes classes derived from the APIObject class and value types
-   Geometry Utility Classes - Includes classes to create non-element geometry and to find intersections of solids
-   Collection Classes - Includes classes derived from the IEnumerable or IEnumerator interface.

In this section, you learn how to use various graphic-related types, how to retrieve geometry data from an element, how to transform an element, and more.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Geometry_GeometryObject_Class_html
author:
---

# Help | GeometryObject Class | Autodesk

> ## Excerpt
> The indexed property Element.Geometry[] can be used to pull the geometry of any model element (3D element). This applies both to system family instances such as walls, floors and roofs, and also to family instances of many categories, e.g. doors, windows, furniture, or masses.

---
The indexed property Element.Geometry\[\] can be used to pull the geometry of any model element (3D element). This applies both to system family instances such as walls, floors and roofs, and also to family instances of many categories, e.g. doors, windows, furniture, or masses.

The property GeometryObject.Id returns an integer value which may be used to identify the GeometryObject in its associated GeometryElement when the value is non-negative and not duplicated by other GeometryObjects in the associated GeometryElement.

The extracted geometry is returned to you as Autodesk.Revit.DB.GeometryElement. You can iterate through the geometry members of that element by using the GetEnumerator() method.

Typically, the objects returned at the top level of the extracted geometry will be one of:

-   Solids, Faces and Edges – a boundary representation made up of faces and edges
-   Meshes – a 3D array of triangles
-   Curves – a bounded 3D curve
-   Points – a visible point datum at a given 3D location
-   PolyLines – a series of line segments defined by 3D points
-   GeometryInstances – an instance of a geometric element positioned within the element

This figure illustrates the hierarchy of objects found by geometry extraction.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Geometry_GeometryObject_Class_Curves_html
author:
---

# Help | Curves | Autodesk

> ## Excerpt
> Share

---
Share

A curve represents a path in 2 or 3 dimensions in the Revit model. Curves may represent the entire extent of an element’s geometry (e.g. CurveElements) or may appear as a single piece of the geometry of an element (e.g. the centerline of a wall or duct). Curves and collections of curves are used as inputs in many element creation methods in the API.

**Pages in this section**

-   Curve analysis
-   Working with Curves
-   Curve collections
-   Curve creation
-   Curve Parameterization
-   Curve types
-   Mathematical representations of curve types

**Parent page:** GeometryObject Class

### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Geometry_GeometryObject_Class_Solids_Faces_and_Edges_html
author:
---

# Help | Solids, Faces and Edges | Autodesk

> ## Excerpt
> A Solid is a Revit API object which represents a collection of faces and edges. Typically in Revit these collections are fully enclosed volumes, but a shell or partially bounded volume can also be encountered. Note that sometimes the Revit geometry will contain unused solids containing zero edges and faces. Check the Edges and Faces members to filter out these solids.

---
A Solid is a Revit API object which represents a collection of faces and edges. Typically in Revit these collections are fully enclosed volumes, but a shell or partially bounded volume can also be encountered. Note that sometimes the Revit geometry will contain unused solids containing zero edges and faces. Check the Edges and Faces members to filter out these solids.

The Revit API offers the ability to read the collections of faces and edges, and also to compute the surface area, volume, and centroid of the solid.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Sketching_html
author:
---

# Help | Sketching | Autodesk

> ## Excerpt
> Sketches define the shape of many elements in Revit such as:

---
Sketches define the shape of many elements in Revit such as:

-   Ceiling
-   Extrusion
-   Filled Region
-   Floor
-   Opening
-   Stair
-   Railing
-   Roof

In addition to Sketch Elements, ModelCurve is also described in this chapter. For more details about Element Classification, see Element Classification in the Elements Essentials section.

## Sketches of Ceilings, Floors, Walls, or Openings

### Getting the Sketch

You cannot retrieve a Sketch object by iterating the Document with a FilteredElementCollector. Instead, use these properties to get the element id of the element's sketch.

-   Ceiling.SketchId
-   Floor.SketchId
-   Opening.SketchId
-   Wall.SketchId

For a given sketch, you can get element (Floor, Wall...) that owns the sketch with the `Sketch.OwnerId` property. `Sketch.GetAllElements()` returns all elements (ModelCurve, ReferencePlane, Dimension) that belong to a sketch.

### Editing and Validating the Sketch

Use the `SketchEditScope` class to edit the sketch. While a Sketch editing session is active, you can add, delete or modify Sketch elements (curves, dimensions, reference planes). A transaction will be needed to make the changes. When you finish the session, the Sketch-based element will be updated.

Key methods include:

-   SketchEditScope constructor - Creates a new SketchEditScope
-   Start() - Starts editing a particular sketch. After this is started only elements owned by the Sketch and new elements to be added to the Sketch may be modified
-   StartWithNewSketch() - Because a valid sketch may not initially exist for some Revit elements (such as Walls or Analytical Elements), a valid sketch will need to be created before it can be edited.
-   Commit() - Commits the changes
-   IsSketchEditingSupported() - Checks if a sketch can be edited with a SketchEditScope

#### Boundary Validation

The `BoundaryValidation` class provides methods to validate curve loops for sketching:

-   `IsValidHorizontalBoundary` identifies whether the provided curve loops create a valid horizontal boundary
-   `IsValidBoundaryOnView` checks that a curve loop boundary is valid on the view's sketch plane.
-   `IsValidBoundaryOnSketchPlane` checks that a curve loop boundary is valid on a sketch plane

**Code Region: Edit a Floor Sketch**

```
private void EditSketch(Floor floor)
{
 // Delete all lines in the sketch & create two new arcs that form a circle
 Document doc = floor.Document;
 Sketch sketch = doc.GetElement(floor.SketchId) as Sketch;
 using (SketchEditScope edit = new SketchEditScope(doc, "Edit Floor"))
 {
  edit.Start(floor.SketchId);
  using (Transaction t = new Transaction(doc, "Edit Sketch"))
  {
   t.Start();

   doc.Delete(sketch.GetAllElements());

   doc.Create.NewModelCurve(
    Arc.Create(sketch.SketchPlane.GetPlane(), 5, 0, Math.PI * 2),
    sketch.SketchPlane);

   t.Commit();
  }
  edit.Commit(new failuresPreprocessor());
 }
}

private class failuresPreprocessor : IFailuresPreprocessor
{
 public FailureProcessingResult PreprocessFailures(FailuresAccessor failuresAccessor)
 {
  return FailureProcessingResult.Continue;
 }
}
```

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Material_html
author:
---

# Help | Material | Autodesk

> ## Excerpt
> In the Revit Platform API, material data is stored and managed as an Element. Just as in the Revit UI, a material can have several assets associated with it, but only thermal and structural (referred to as Physical in the Revit UI) assets can be assigned using the API.

---
In the Revit Platform API, material data is stored and managed as an Element. Just as in the Revit UI, a material can have several assets associated with it, but only thermal and structural (referred to as Physical in the Revit UI) assets can be assigned using the API.

Some material features are represented by properties on the Material class itself, such as FillPattern, Color, or Render while others are available as properties of either a structural or thermal asset associated with the material.

In this chapter, you learn how to access material elements and how to manage the Material objects in the document. Element Material provides a walkthrough showing how to get a window material.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Revit_Geometric_Elements_Stairs_and_Railings_html
author:
---

# Help | Stairs and Railings | Autodesk

> ## Excerpt
> Classes in the Revit API in the Autodesk.Revit.DB.Architecture namespace allow access to stairs and related components such as landings and runs. Stairs can be created or modified using the Revit API. The Stairs class represents stairs created "by component". Stair elements that were created by sketch cannot be accessed as a Stair object in the API. The static method Stairs.IsByComponent() can be used to determine if an ElementId represents stairs that were created by component.

---
### Stairs

Classes in the Revit API in the Autodesk.Revit.DB.Architecture namespace allow access to stairs and related components such as landings and runs. Stairs can be created or modified using the Revit API. The Stairs class represents stairs created "by component". Stair elements that were created by sketch cannot be accessed as a Stair object in the API. The static method Stairs.IsByComponent() can be used to determine if an ElementId represents stairs that were created by component.

**Pages in this section**

-   Creating and Editing Stairs
-   Railings
-   Stairs Annotations
-   Stairs Components

**Parent page:** Revit Geometric Elements

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_html
author:
---

# Help | Discipline-Specific Functionality | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_Architecture_html
author:
---

# Help | Architecture | Autodesk

> ## Excerpt
> This chapter covers API functionality that is specific to the architectural features of Revit:

---
This chapter covers API functionality that is specific to the architectural features of Revit:

-   Functionality related to rooms (Element.Room, RoomTag, etc.)

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_MEP_Engineering_html
author:
---

# Help | MEP Engineering | Autodesk

> ## Excerpt
>

---
-   Help Home

-   What's New in Revit
-   Revit 2023 Release Notes
-   Get Started
-   Have You Tried
-   Cloud Models
-   Model the Design
-   Architectural Design
-   Structural Engineering
-   MEP Engineering
-   Document and Present the Design
-   Analyze the Design
-   Collaborate with Others
-   Customize Revit
-   Dynamo for Revit
-   Revit and Revit LT Installation
-   Autodesk Installation
-   Revit Developer's Guide
    -   Revit API Developers Guide
        -   Introduction
        -   Basic Interaction with Revit Elements
        -   Revit Geometric Elements
        -   Discipline-Specific Functionality
            -   Architecture
            -   Civil Alignments API
            -   MEP Engineering
                -   MEP Element Creation
                -   MEP Systems
                -   Connectors
                -   MEP Fabrication Detailing
                -   Family Creation
                -   Mechanical Settings
                -   Electrical Analysis for Preliminary Design
                -   Electrical Settings
                -   Routing Preferences
            -   Structural Engineering
            -   Site
        -   Advanced Topics
        -   Appendices
        -   FAQ
-   Troubleshoot

To support MEP engineering features of the Revit software, the API provides read and write access to HVAC and Piping data in a Revit model including:

-   Traversing ducts, pipes, fittings, and connectors in a system
-   Adding, removing, and changing ducts, pipes, and other equipment
-   Getting and setting system properties
-   Determining if the system is well-connected
-   Access to Mechanical Settings
-   Managing Routing Preferences

### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_MEP_Engineering_MEP_Element_Creation_html
author:
---

# Help | MEP Element Creation | Autodesk

> ## Excerpt
> MEP Elements can be created using the Revit API.

---
MEP Elements can be created using the Revit API.

Many elements related to duct, pipe and electrical systems can be created using the following methods available in the Autodesk.Revit.Creation.Document class:

-   NewFlexDuct
-   NewFlexPipe
-   NewMechanicalSystem
-   NewPipingSystem
-   NewCrossFitting
-   NewElbowFitting
-   NewTakeoffFitting
-   NewTeeFitting
-   NewTransitionFitting
-   NewUnionFitting

Other MEP elements, such as pipes, can only be created using the static Create() method of its corresponding class. Some MEP elements, such as ducts, can be created by a static method of the corresponding class (i.e. Duct) or by a method of the Autodesk.Revit.Creation.Document class. For these elements, the static Create() method is preferred.

-   Duct
-   FlexDuct
-   Pipe
-   FlexPipe
-   PipingSystem
-   Wire

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_Structural_Engineering_html
author:
---

# Help | Structural Engineering | Autodesk

> ## Excerpt
> The following sections describe API features that only pertain to the structural engineering features of Revit:

---
The following sections describe API features that only pertain to the structural engineering features of Revit:

-   Structural Model Elements - Discusses specific Elements and their properties that only relate to the structural engineering features of Revit.
-   AnalyticalModel - Discusses analytical model-related classes such as AnalyticalModel, RigidLink, and AnalyticalModelSupport.
-   AnalyticalLink - Discusses creating new analytical links between analytical beams and columns.
-   Loads - Discusses Load Settings and three kinds of Loads.
-   Your Analysis Link - Provides suggestions for API users who want to link Revit to certain Structural Analysis applications.

This chapter contains some advanced topics. If you are not familiar with the Revit Platform API, read the basic sections first, such as Getting Started, Elements Essentials, Parameters, and so on.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_Structural_Engineering_Structural_Model_Elements_html
author:
---

# Help | Structural Model Elements | Autodesk

> ## Excerpt
> Structural Model Elements are, literally, elements that support a structure such as columns, rebar, trusses, and so on. The following section describe how to manipulate these elements.

---
Structural Model Elements are, literally, elements that support a structure such as columns, rebar, trusses, and so on. The following section describe how to manipulate these elements.

The model elements included in this section are specific to the structural engineering features of Revit. For more information about other structural element classes, see the corresponding parts in Walls, Floors, Ceilings, Roofs and Openings and Family Instances.

**Pages in this section**

-   Structural Columns, Beams and Braces
-   Trusses
-   Reinforcement
-   Boundary Conditions
-   Slabs

**Parent page:** Structural Engineering

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_Structural_Engineering_Structural_Model_Elements_Reinforcement_html
author:
---

# Help | Reinforcement | Autodesk

> ## Excerpt
> The Revit API provides classes to manage reinforcement, such as rebar or fabric sheets, in valid hosts such as concrete columns, beams, walls, foundations, and structural floors.

---
The Revit API provides classes to manage reinforcement, such as rebar or fabric sheets, in valid hosts such as concrete columns, beams, walls, foundations, and structural floors.

**Pages in this section**

-   Rebar
-   Rebar Couplers
-   Area and Path Reinforcement
-   Fabric Reinforcement
-   Rebar Containers
-   Reinforcement Settings
-   Reinforcement Rounding
-   Annotation

**Parent page:** Structural Model Elements

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_html
author:
---

# Help | Advanced Topics | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Analysis_html
author:
---

# Help | Analysis | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Analysis_Analysis_Visualization_html
author:
---

# Help | Analysis Visualization | Autodesk

> ## Excerpt
> The Revit API provides a mechanism for external analysis applications to easily display the results of their computation in the Revit model. The SpatialFieldManager class is the main class for communicating analysis results back to Revit. It is used to create, delete, and modify the "containers" in which the analysis results are stored. The AnalysisResultSchema class contains all information about one analysis result, such as a description and the names and multipliers of all units for result visualization. Multiple AnalysisResultSchemas can be registered with the SpatialFieldManager.

---
The Revit API provides a mechanism for external analysis applications to easily display the results of their computation in the Revit model. The SpatialFieldManager class is the main class for communicating analysis results back to Revit. It is used to create, delete, and modify the "containers" in which the analysis results are stored. The AnalysisResultSchema class contains all information about one analysis result, such as a description and the names and multipliers of all units for result visualization. Multiple AnalysisResultSchemas can be registered with the SpatialFieldManager.

The AnalysisDisplayStyle class can then be used to control the appearance of the results. Creation and modification of AnalysisDisplayStyle from a plug-in is optional; end users can have the same control over the presentation of the analysis results with the Revit UI.

The data model supported by Revit API requires that analysis results are specified at a certain set of points, and that at each point one or more distinct numbers ("measurements") are computed. The number of measurements must be the same at all model points. The results data is transient; it is stored only in the model until the document is closed. If the model is saved, closed, and reopened the analysis results will not be present.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Construction_Modeling_html
author:
---

# Help | Construction Modeling | Autodesk

> ## Excerpt
> The Revit API allows elements to be divided into sub-parts or collected into assemblies to support construction modeling workflows, much the same way as can be done with the Revit user interface. Both parts and assemblies can be independently scheduled, tagged, filtered, and exported. You can also divide a part into smaller parts. After creating an assembly type, you can place additional instances in the project and generate isolated assembly views.

---
The Revit API allows elements to be divided into sub-parts or collected into assemblies to support construction modeling workflows, much the same way as can be done with the Revit user interface. Both parts and assemblies can be independently scheduled, tagged, filtered, and exported. You can also divide a part into smaller parts. After creating an assembly type, you can place additional instances in the project and generate isolated assembly views.

The main classes related to Construction Modeling are:

-   **AssemblyInstance** - This class combines multiple elements for tagging, filtering, scheduling and creating isolated assembly views.
-   **AssemblyType** - Represents a type for construction assembly elements. Each new unique assembly created in the project automatically creats a corresponding AssemblyType. A new AssemblyInstance can be placed in the document from an existing AssemblyType.
-   **PartUtils** - This utility class contains general part utility methods, including the ability to create parts, divide parts, and to get information about parts.
-   **AssemblyViewUtils** - A utility class to create various types of assembly views.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Dynamic_Model_Update_html
author:
---

# Help | Dynamic Model Update | Autodesk

> ## Excerpt
> Dynamic model update offers the ability for a Revit API application to modify the Revit model as a reaction to changes happening in the model when those changes are about to be committed at the end of a transaction. Revit API applications can create updaters by implementing the IUpdater interface and registering it with the UpdaterRegistry class. Registering includes specifying what changes in the model should trigger the updater.

---
Dynamic model update offers the ability for a Revit API application to modify the Revit model as a reaction to changes happening in the model when those changes are about to be committed at the end of a transaction. Revit API applications can create updaters by implementing the IUpdater interface and registering it with the UpdaterRegistry class. Registering includes specifying what changes in the model should trigger the updater.

**Pages in this section**

-   Implementing IUpdater
-   The Execute method
-   Registering Updaters
-   Exposure to End-User

**Parent page:** Advanced Topics

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Storing_Data_in_the_Revit_model_html
author:
---

# Help | Storing Data in the Revit model | Autodesk

> ## Excerpt
> Use shared parameters or extensible storage to store data in the Revit model.

---
Use shared parameters or extensible storage to store data in the Revit model.

The Revit API provides two methods for storing data in the Revit model. The first is using shared parameters. The Revit API gives programmatic access to the same shared parameters feature that is available through the Revit UI. Shared parameters, if defined as visible, will be viewable to the user in an element's property window. Shared parameters can be assigned to many, but not all, categories of elements. For more information, see Shared Parameters.

The other option is extensible storage, which allows you to create custom data structures and then assign instances of that data to elements in the model. This data is never visible to the user in the Revit UI, but may be accessible to other third party applications via the Revit API depending on the read/write access assigned to the schema when it is defined. Unlike Shared Parameters, extensible storage is not limited to certain categories of elements. Extensible storage data can be assigned to any object that derives from the base class Element in the Revit model.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Events_html
author:
---

# Help | Events | Autodesk

> ## Excerpt
> Events are notifications that are triggered on specific actions in the Revit user interface or API workflows. By subscribing to events, an add-in application can be notified when an action is about to happen or has just happened and take some action related to that event. Some events come in pairs around actions, one occurring before the action takes place ("pre" event) and the other happening after the action takes place ("post" event). Events that do not occur in these pre/post pairs are called "single" events.

---
Events are notifications that are triggered on specific actions in the Revit user interface or API workflows. By subscribing to events, an add-in application can be notified when an action is about to happen or has just happened and take some action related to that event. Some events come in pairs around actions, one occurring before the action takes place ("pre" event) and the other happening after the action takes place ("post" event). Events that do not occur in these pre/post pairs are called "single" events.

Revit provides access to events at both the Application level (such as ApplicationClosing or DocumentOpened) and the Document level (such as DocumentClosing and DocumentPrinting). The same application level events available from the Application class are also available from the ControlledApplication class, which represents the Revit application with no access to documents. It is ControlledApplication that is available to add-ins from the OnStartup() and OnShutdown() methods. In terms of subscribing and unsubscribing to events, these classes are interchangeable; subscribing to an event from the ControlledApplication class is the same as subscribing from the Application class.

Events can also be categorized as database (DB) events or user interface (UI) events. DB events are available from the Application and Document classes, while UI events are available from the UIApplication class. (Currently all UI events are at the application level only).

Some events are considered read-only, which means that during their execution the model may not be modified. The fact that an event is read-only is documented in the API help file. It is important to know that even during regular events (i.e. not read-only events), the model may be in a state in which it cannot be modified. The programmer should check the properties Document.IsModifiable and Document.IsReadOnly to determine whether the model may be modified.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Events_Database_Events_html
author:
---

# Help | Database Events | Autodesk

> ## Excerpt
> The following table lists database events, their type and whether they are available at the application and/or document level:

---
The following table lists database events, their type and whether they are available at the application and/or document level:

**Table 53: DB Event Types**

<table summary="" id="GUID-BB901E53-61FD-4D4A-8571-3CC6582DA85A__TABLE_DF9946D275D04F2785B0ED6712065C42"><tbody><tr><td><b>Event</b></td><td><b>Type</b></td><td><b>Application</b></td><td><b>Document</b></td></tr><tr><td><a href="https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Events_Database_Events_DocumentChanged_event_html" data-url="https://help.autodesk.com/cloudhelp/2023/ENU/Revit-API/files/Revit_API_Developers_Guide/Advanced_Topics/Events/Database_Events/Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Events_Database_Events_DocumentChanged_event_html.html">DocumentChanged event</a></td><td>single</td><td>X</td><td></td></tr><tr><td>DocumentClosing</td><td>pre</td><td>X</td><td>X</td></tr><tr><td>DocumentClosed</td><td>post</td><td>X</td><td></td></tr><tr><td>DocumentCreating</td><td>pre</td><td>X</td><td></td></tr><tr><td>DocumentCreated</td><td>post</td><td>X</td><td></td></tr><tr><td>DocumentOpening</td><td>pre</td><td>X</td><td></td></tr><tr><td>DocumentOpened</td><td>post</td><td>X</td><td></td></tr><tr><td>DocumentPrinting</td><td>pre</td><td>X</td><td>X</td></tr><tr><td>DocumentPrinted</td><td>post</td><td>X</td><td>X</td></tr><tr><td>DocumentSaving</td><td>pre</td><td>X</td><td>X</td></tr><tr><td>DocumentSaved</td><td>post</td><td>X</td><td>X</td></tr><tr><td>DocumentSavingAs</td><td>pre</td><td>X</td><td>X</td></tr><tr><td>DocumentSavedAs</td><td>post</td><td>X</td><td>X</td></tr><tr><td>DocumentSynchronizingWithCentral</td><td>pre</td><td>X</td><td></td></tr><tr><td>DocumentSynchronizedWithCentral</td><td>post</td><td>X</td><td></td></tr><tr><td>FailuresProcessing</td><td>single</td><td>X</td><td></td></tr><tr><td>FileExporting</td><td>pre</td><td>X</td><td></td></tr><tr><td>FileExported</td><td>post</td><td>X</td><td></td></tr><tr><td>FileImporting</td><td>pre</td><td>X</td><td></td></tr><tr><td>FileImported</td><td>post</td><td>X</td><td></td></tr><tr><td>ProgressChanged</td><td>single</td><td>X</td><td>&nbsp;</td></tr><tr><td>ViewPrinting</td><td>pre</td><td>X</td><td>X</td></tr><tr><td>ViewPrinted</td><td>post</td><td>X</td><td>X</td></tr></tbody></table>

-   DocumentChanged - notification when a transaction is committed, undone or redone
-   DocumentClosing - notification when Revit is about to close a document
-   DocumentClosed - notification just after Revit has closed a document
-   DocumentCreating - notification when Revit is about to create a new document
-   DocumentCreated - notification when Revit has finished creating a new document
-   DocumentOpening - notification when Revit is about to open a document
-   DocumentOpened - notification after Revit has opened a document
-   DocumentPrinting - notification when Revit is about to print a view or ViewSet of the document
-   DocumentPrinted - notification just after Revit has printed a view or ViewSet of the document
-   DocumentSaving - notification when Revit is about to save the document
-   DocumentSaved - notification just after Revit has saved the document
-   DocumentSavingAs - notification when Revit is about to save the document with a new name
-   DocumentSavedAs - notification when Revit has just saved the document with a new name
-   DocumentSynchronizingWithCentral - notification when Revit is about to synchronize a document with the central file
-   DocumentSynchronizedWithCentral - notification just after Revit has synchronized a document with the central file
-   FailuresProcessing - notification when Revit is processing failures at the end of a transaction
-   FileExporting - notification when Revit is about to export to a file format supported by the API
-   FileExported - notification after Revit has exported to a file format supported by the API
-   FileImporting - notification when Revit is about to import a file format supported by the API
-   FileImported - notification after Revit has imported a file format supported by the API
-   ProgressChanged - notification when an operation in Revit has progress bar data
-   ViewPrinting - notification when Revit is about to print a view of the document
-   ViewPrinted - notification just after Revit has printed a view of the document

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Export_html
author:
---

# Help | Export | Autodesk

> ## Excerpt
> The Revit API allows for a Revit document, or a portion thereof, to be exported to various formats for use with other software. The Document class has an overloaded Export() method that will initiate an export of a document using the built-in exporter in Revit (when available). For more advanced needs, some types of exports can be customized with a Revit add-in, such as export to IFC and export to Navisworks. (Note, Navisworks export is only available as an add-in exporter).

---
The Revit API allows for a Revit document, or a portion thereof, to be exported to various formats for use with other software. The Document class has an overloaded Export() method that will initiate an export of a document using the built-in exporter in Revit (when available). For more advanced needs, some types of exports can be customized with a Revit add-in, such as export to IFC and export to Navisworks. (Note, Navisworks export is only available as an add-in exporter).

The Document.Export() method overloads are outlined in the table below.

**Table: Document.Export() Methods**

<table summary="" id="GUID-A1BE34A2-DA7C-4C2C-9CCB-958A56F1150D__TABLE_EDA7D7AB3C5944EA8D4A0E634918E5E0"><tbody><tr><td><b>Format</b></td><td><b>Export() parameters</b></td><td><b>Comments</b></td></tr><tr><td>gbXML</td><td>String, String, GBXMLExportOptions</td><td>Exports a gbXML file from a mass model document</td></tr><tr><td>gbXML</td><td>String, String, GBXMLExportOptions</td><td>Exports the document in Green-Building XML format. If EnergyDataSettings is set to use conceptual models, this function cannot be used: instead use the method above.</td></tr><tr><td>IFC</td><td>String, String, IFCExportOptions</td><td>Exports the document to the Industry Standard Classes (IFC) format.</td></tr><tr><td>NWC</td><td>String, String, NavisworksExportOptions</td><td>Exports a Revit project to the Navisworks .nwc format. Note that in order to use this function,you must have a compatible Navisworks exporter add-in registered with your session of Revit.</td></tr><tr><td>DWF</td><td>String, String, ViewSet, DWFExportOptions</td><td>Exports the current view or a selection of views in DWF format.</td></tr><tr><td>DWFX</td><td>String, String, ViewSet, DWFXExportOptions</td><td>Exports the current view or a selection of views in DWFX format.</td></tr><tr><td>FBX</td><td>String, String, ViewSet, FBXExportOptions</td><td>Exports the document in 3D-Studio Max (FBX) format.</td></tr><tr><td>DGN</td><td>String, String, ICollection(ElementId), DGNExportOptions</td><td>Exports a selection of views in DGN format.</td></tr><tr><td>DWG</td><td>String, String, ICollection(ElementId), DWGExportOptions</td><td>Exports a selection of views in DWG format.</td></tr><tr><td>DXF</td><td>String, String, ICollection(ElementId), DXFExportOptions</td><td>Exports a selection of views in DXF format.</td></tr><tr><td>SAT</td><td>String, String, ICollection(ElementId), SATExportOptions</td><td>Exports the current view or a selection of views in SAT format.</td></tr><tr><td>PDF</td><td>String, IList(ElementId), PDFExportOptions</td><td>Exports a selection of views in PDF format.</td></tr></tbody></table>

#### Exporting to gbXML

There are two methods for exporting to the Green Building XML format. The one whose last parameter is GBXMLExportOptions is only available for projects containing one or more instances of Conceptual Mass families. The GBXMLExportOptions object to pass into this method can be constructed with just the ids of the mass zones to analyze in the exported gbXML, or with the mass zone ids and the ids of the masses to use as shading surfaces in the exported gbXML. Whe using masses, they must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.

The GBXMLExportOptions object used for the other gbXML export option has no settings to specify. It uses all default settings. Note that this method does not generate the energy model. The main energy model must already be stored in the document before this export is invoked.

#### Exporting to IFC

Calling Document.Export() using the IFC option will either use the default Revit IFC export implementation or a custom IFC Export, if one has been registered with the current session of Revit. In either case, the IFCExportOptions class is used to set export options such as whether to export IFC standard quantities currently supported by Revit or to allow division of multi-level walls and columns by levels.

#### Exporting to Navisworks

The Export method for Navisworks requires a compatible Navisworks exporter add-in registered with the current Revit session. If there is no compatible exporter registered, the method will throw an exception. Use the OptionalFunctionalityUtils.IsNavisworksExporterAvailable() method to determine if a Navisworks exporter is registered.

The NavisworksExportOptions object can be used to set numerous export settings for exporting to Navisworks, such as whether to divide the file into levels and whether or not to export room geometry. Additionally, the NavisworksExportOptions.ExportScope property specifieds the export scope. The default is Model. Other options include View and SelectedElements. When set to View, the NavisworksExportOptions . ViewId property should be set accordingly. This property is only used when the export scope is set to View. When set to SelectedElements, the NavisworksExportOptions . SetSelectedElementIds() method should be called with the ids of the elements to be exported.

#### Exporting to DWF and DWFX

Both DWF and DWFX files can be exported using the corresponding Document.Export() overloads. Both methods have a ViewSet parameter that represents the views to be exported. All the views in the ViewSet must be printable in order for the export to succeed. This can be checked using the View.CanBePrinted property of each view. The last parameter is either DWFExportOptions or DWFXExportOptions. DWFXExportOptions is derived from DWFExportOptions and has all the same export settings. Options include whether or not to export the crop box, the image quality whether or not to export textures to 3D DWF files, and the paper format.

<table summary="" id="GUID-A1BE34A2-DA7C-4C2C-9CCB-958A56F1150D__TABLE_1BB826B11FB04198B5250D174FFC45D8"><tbody><tr><td><b>Code Region: Export DWF</b></td></tr><tr><td><pre><code><span>public</span><span> </span><span>bool</span><span> </span><span>ExportViewToDWF</span><span>(</span><span>Document</span><span> document</span><span>,</span><span> </span><span>View</span><span> view</span><span>,</span><span> </span><span>string</span><span> pathname</span><span>)</span><span>
</span><span>{</span><span>
    </span><span>DWFExportOptions</span><span> dwfOptions </span><span>=</span><span> </span><span>new</span><span> </span><span>DWFExportOptions</span><span>();</span><span>
    </span><span>// export with crop box and area and room geometry</span><span>
    dwfOptions</span><span>.</span><span>CropBoxVisible</span><span> </span><span>=</span><span> </span><span>true</span><span>;</span><span>
    dwfOptions</span><span>.</span><span>ExportingAreas</span><span> </span><span>=</span><span> </span><span>true</span><span>;</span><span>
    dwfOptions</span><span>.</span><span>ExportTexture</span><span> </span><span>=</span><span> </span><span>false</span><span>;</span><span>
    </span><span>ViewSet</span><span> views </span><span>=</span><span> </span><span>new</span><span> </span><span>ViewSet</span><span>();</span><span>
    views</span><span>.</span><span>Insert</span><span>(</span><span>view</span><span>);</span><span>
    </span><span>return</span><span> </span><span>(</span><span>document</span><span>.</span><span>Export</span><span>(</span><span>Path</span><span>.</span><span>GetDirectoryName</span><span>(</span><span>pathname</span><span>),</span><span>
        </span><span>Path</span><span>.</span><span>GetFileNameWithoutExtension</span><span>(</span><span>pathname</span><span>),</span><span> views</span><span>,</span><span> dwfOptions</span><span>));</span><span>
</span><span>}</span></code></pre></td></tr></tbody></table>

#### Exporting to 3D-Studio Max

FBX Export requires the presence of certain modules that are optional and may not be part of the installed Revit, so the OptionalFunctionalityUtils . IsFBXExportAvailable() method reports whether the FBX Export functionality is available. The Export() method for exporting to 3D-Studio Max has a ViewSet parameter representing the set of views to export. Only 3D views are allowed. The FBXExportOptions parameter can be used to specify whether to export without boundary edges, wther to use levels of detail, and whether the export process should stop when a view fails to export.

#### Exporting to CAD Formats

Exporting to DGN , DWG and DXF format files have similar export methods and options.

DGN , DWG and DXF Export all require the presence of certain modules that are optional and may not be part of the installed version of Revit, so the OptionalFunctionalityUtils class as corresponding methods to reports whether the each of these types of export functionality are available.

The Export() methods for exporting to DGN, DWG and DXF formats all have a parameter representing the views to be exported (as an ICollection of the ElementIds of the views). At least one valid view must be present and it must be printable for the export to succeed. This can be checked using the View.CanBePrinted property of each view.

The export options for each of these formats derives from BaseExportOptions, so there are many export settings in common, such as the color mode or whether or not to hide the scope box. BaseExportOptions also has a static method called GetPredefinedSetupNames() which will return any predefined setups for a document. The name of a predefined setup can then be passed into the static method GetPredefinedOptions() available from the corresponding options class: DWGExportOptions, DGNExportOptions or DXFExportOptions. The export options for DWG and DXF files have even more options in common as they share the base class ACADExportOptions.

The following example exports the active view (if it can be printed) to a DGN file using the first predefined setup name and the predefined options, without making any changes.

<table summary="" id="GUID-A1BE34A2-DA7C-4C2C-9CCB-958A56F1150D__TABLE_828E9F5353004D06ACED2092FD80BF66"><tbody><tr><td><b>Code Region: Export DGN</b></td></tr><tr><td><pre><code><span>public</span><span> </span><span>bool</span><span> </span><span>ExportDGN</span><span>(</span><span>Document</span><span> document</span><span>,</span><span> </span><span>View</span><span> view</span><span>)</span><span>
</span><span>{</span><span>
    </span><span>bool</span><span> exported </span><span>=</span><span> </span><span>false</span><span>;</span><span>
    </span><span>// Get predefined setups and export the first one</span><span>
    </span><span>IList</span><span>&lt;string&gt;</span><span> setupNames </span><span>=</span><span> </span><span>BaseExportOptions</span><span>.</span><span>GetPredefinedSetupNames</span><span>(</span><span>document</span><span>);</span><span>
    </span><span>if</span><span> </span><span>(</span><span>setupNames</span><span>.</span><span>Count</span><span> </span><span>&gt;</span><span> </span><span>0</span><span>)</span><span>
    </span><span>{</span><span>
        </span><span>// Get predefined options for first predefined setup</span><span>
        </span><span>DGNExportOptions</span><span> dgnOptions </span><span>=</span><span> </span><span>DGNExportOptions</span><span>.</span><span>GetPredefinedOptions</span><span>(</span><span>document</span><span>,</span><span> setupNames</span><span>[</span><span>0</span><span>]);</span><span>

        </span><span>// export the active view if it is printable</span><span>
        </span><span>if</span><span> </span><span>(</span><span>document</span><span>.</span><span>ActiveView</span><span>.</span><span>CanBePrinted</span><span> </span><span>==</span><span> </span><span>true</span><span>)</span><span>
        </span><span>{</span><span>
            </span><span>ICollection</span><span>&lt;</span><span>ElementId</span><span>&gt;</span><span> views </span><span>=</span><span> </span><span>new</span><span> </span><span>List</span><span>&lt;</span><span>ElementId</span><span>&gt;();</span><span>
            views</span><span>.</span><span>Add</span><span>(</span><span>view</span><span>.</span><span>Id</span><span>);</span><span>
            exported </span><span>=</span><span> document</span><span>.</span><span>Export</span><span>(</span><span>Path</span><span>.</span><span>GetDirectoryName</span><span>(</span><span>document</span><span>.</span><span>PathName</span><span>),</span><span>
                </span><span>Path</span><span>.</span><span>GetFileNameWithoutExtension</span><span>(</span><span>document</span><span>.</span><span>PathName</span><span>),</span><span> views</span><span>,</span><span> dgnOptions</span><span>);</span><span>
        </span><span>}</span><span>
 </span><span>}</span><span>

    </span><span>return</span><span> exported</span><span>;</span><span>
</span><span>}</span></code></pre></td></tr></tbody></table>

For these file types it is possible to specify or modify various mapping settings, such as layer mapping or text font mapping by creating the corresponding table and passing it into the appropriate method of the BaseExportOptions class. For layer mapping, you may alternatively pass in a string value to BaseExportOptions.LayerMapping of a predefined layer mapping style or the filename of a layer mapping file. For more information on creating or modifying export tables, see the Export Tables topic.

#### Exporting to SAT

The Export method for SAT has a parameter representing the views to be exported (as an ICollection of the ElementIds of the views). At least one valid view must be present and it must be printable for the export to succeed. This can be checked using the View.CanBePrinted property of each view. The SATExportOptions object has no settings to specify. It uses all default settings.

#### Exporting to Civil Engineering Design Applications

The last Export() method exports a 3D view of the document in the format of Civil Engineering design applications. One parameter of the method is a Viewplan that specifies the gross area plan. All the areas on the view plan will be exported and it must be 'Gross Building' area plan. To check whether its area scheme is Gross Building, use the AreaScheme.GrossBuildingArea property. The BuildingSiteExportOptions object allows custom values for settings such as gross area or total occupancy.

#### Exporting to PDF

**Code Region: Print all sheets to PDF**

```
private void PDFExport(Document doc)
{
    PDFExportOptions opt = new PDFExportOptions();
    opt.Combine = true;
    opt.FileName = "My House";
    opt.PaperFormat = ExportPaperFormat.ARCH_E;
    doc.Export(
        Environment.GetFolderPath(Environment.SpecialFolder.Desktop),
        new FilteredElementCollector(doc)
            .OfClass(typeof(ViewSheet))
            .ToElementIds().ToList(),
        opt);
}
```

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Failure_Posting_and_Handling_html
author:
---

# Help | Failure Posting and Handling | Autodesk

> ## Excerpt
> Share

---
Share

The Revit API provides the ability to post failures when a user-visible problem has occurred and to respond to failures posted by Revit or Revit add-ins.

**Pages in this section**

-   Posting Failures
-   Handling Failures

**Parent page:** Advanced Topics

### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Linked_Files_html
author:
---

# Help | Linked Files | Autodesk

> ## Excerpt
> The Revit API can determine which elements in Revit are references to external files ("linked files") and can make some modifications to how Revit loads external files.

---
The Revit API can determine which elements in Revit are references to external files ("linked files") and can make some modifications to how Revit loads external files.

An Element which contains an ExternalFileReference is an element which refers to some file outside of the base .rvt file. Examples include Revit links, CAD links, the element which stores the location of the keynote file, and rendering decals. Element.IsExternalFileReference() returns whether or not an element represents an external file. And Element.GetExternalFileReference() returns the ExternalFileReference for a given Element which contains information pertaining to the external file referenced by the element.

The following classes are associated with linked files in the Revit API:

-   **ExternalFileReference** - A non-Element class which contains path and type information for a single external file which a Revit project references.
-   **ExternalFileUtils** - A utility class which allows the user to find all external file references, get the external file reference from an element, or tell whether an element is an external file reference.
-   **RevitLinkType** - An element representing a Revit file linked into a Revit project.
-   **ModelPath** - A non-Element class which contains path information for a file (not necessarily a .rvt file.) Paths can be to a location on a local or network drive, or to a Revit Server location.
-   **ModelPathUtils** - A utility class which provides methods for converting between strings and ModelPaths.
-   **TransmissionData** - A class which stores information about all of the external file references in a document. The TransmissionData for a Revit project can be read without opening the document.

    ### ModelPath

ModelPaths are paths to another file. They can refer to Revit models, or to any of Revit's external file references such as DWG links. Paths can be relative or absolute, but they must include an extension indicating the file type. Relative paths are generally relative to the currently opened document. If the current document is workshared, paths will be treated as relative to the central model. To create a ModelPath, use one of the derived classes FilePath or ServerPath.

The class ModelPathUtils contains utility functions for converting ModelPaths to and from user-visible path strings, as well as to determine if a string is a valid server path.

Shared Coordinates let the position of one linked file be known to other linked models.

-   Document.AcquireCoordinates acquires the project coordinates from a specified link instance. This works for both Revit links (RevitLinkInstance) and DWG links (ImportInstance).
-   Document.PublishCoordinates - Publishes shared coordinates to a specified ProjectLocation. This method works only on Revit links. These read-only properties provide information on the geographic coordinate system of a SiteLocation. The geographic coordinate system is imported from a DWG file from AutoCAD or Civil 3D. If the SiteLocation has geographic coordinate system information, the latitude and longitude of the SiteLocation will be updated automatically when the model's Survey Point is moved.

-   SiteLocation.GeoCoordinateSystemId - Gets a string corresponding to geographic coordinate system ID, such as "AMG-50" or "Beijing1954/a.GK3d-40" for the SiteLocation. The value will be the empty string if there is no coordinate system specified for the SiteLocation.
-   SiteLocation.GeoCoordinateSystemDefinition - Gets an XML string describing the geographic coordinate system. The value will be the empty string if there is no coordinate system specified for the SiteLocation.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Place_and_Locations_html
author:
---

# Help | Place and Locations | Autodesk

> ## Excerpt
> Every building has a unique place in the world because the Latitude and Longitude are unique. In addition, a building can have many locations in relation to other buildings. The Revit Platform API Site namespace uses certain classes to save the geographical location information for Revit projects.

---
Every building has a unique place in the world because the Latitude and Longitude are unique. In addition, a building can have many locations in relation to other buildings. The Revit Platform API Site namespace uses certain classes to save the geographical location information for Revit projects.

Note: The Revit Platform API does not expose the Site menu functions. Only Site namespace provides functions corresponding to the Location options found on the Project Location panel on the Manage tab.

### Topics in this section

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Point_Clouds_html
author:
---

# Help | Point Clouds | Autodesk

> ## Excerpt
> The Revit API provides 2 ways to work with point clouds. The first way allows you to create new point cloud instances, read and filter points, select sub-sets of the overall points, and select points to be highlighted or isolated. The second way allows you to use your own point cloud engine and process unsupported file formats (i.e. other than .pcg, .rcp or .rcs), providing points to Revit for the user to see.

---
The Revit API provides 2 ways to work with point clouds. The first way allows you to create new point cloud instances, read and filter points, select sub-sets of the overall points, and select points to be highlighted or isolated. The second way allows you to use your own point cloud engine and process unsupported file formats (i.e. other than .pcg, .rcp or .rcs), providing points to Revit for the user to see.

-   Client API

    -   Create new Point Cloud instances
    -   Read & Filter Points
    -   Point Set Selection
    -   Control Point Cloud highlighting
-   Engine API

    -   Register Point Cloud file extension
    -   Provide points to Revit for rendering

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Advanced_Topics_Worksharing_html
author:
---

# Help | Worksharing | Autodesk

> ## Excerpt
> Worksharing is a design method that allows multiple team members to work on the same project model at the same time. When worksharing is enabled, a Revit document can be subdivided into worksets, which are collections of elements in the project.

---
Worksharing is a design method that allows multiple team members to work on the same project model at the same time. When worksharing is enabled, a Revit document can be subdivided into worksets, which are collections of elements in the project.

**Pages in this section**

-   Worksharing Overview
-   Worksets
-   Elements in Worksets
-   Editing Elements in Worksets
-   Opening a Workshared Document
-   Visibility and Display
-   Workshared File Management

**Parent page:** Advanced Topics

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Appendices_html
author:
---

# Help | Appendices | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Appendices_Glossary_html
author:
---

# Help | Glossary | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Appendices_Hello_World_for_VB_NET_html
author:
---

# Help | Hello World for VB.NET | Autodesk

> ## Excerpt
> Directions for creating the sample application for Visual Basic .NET are available in the following sections. The sample application was created using Microsoft Visual Studio.

---
Directions for creating the sample application for Visual Basic .NET are available in the following sections. The sample application was created using Microsoft Visual Studio.

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Appendices_Concrete_Section_Definitions_html
author:
---

# Help | Concrete Section Definitions | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:34:59 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Appendices_API_User_Interface_Guidelines_html
author:
---

# Help | API User Interface Guidelines | Autodesk

> ## Excerpt
>

---
### Was this information helpful?

-   Yes
-   No

---

---
created: 2026-01-28T21:30:45 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Introduction_Getting_Started_Using_the_Autodesk_Revit_API_Deployment_Options_html
author:
---

# Help | FAQ | Autodesk

> ## Excerpt
> Questions and answers about the Revit API language environment, development tools, best practices, and other common issues.

---
Questions and answers about the Revit API language environment, development tools, best practices, and other common issues.

## Development Environment

What versions of Visual Studio do I need for Revit API development? Can I use Visual C# Community?

-   To edit and debug your API applications, you need an interactive development environment such as Microsoft Visual Studio 2019 Professional or one of the MS Visual Studio Community Editions for C# or Visual Basic.NET

What languages are supported for Revit API development?

-   C#, VB.NET, and C++/CLI are supported for addin development. C#, VB.NET, and IronPython are supported for macro development. Other CLR languages may work with the Revit API, but they are untested and unsupported. Note that for mixed managed/native applications using C++, Revit uses the Visual C++ Redistributable for Visual Studio 2019.. Add-ins compiled with other versions of the VC runtime may not work correctly since the Revit install does not include any other VC runtimes.

## Addins

Is there a wizard to help generate Revit Addins?

-   Yes. Please see http://thebuildingcoder.typepad.com/blog/2014/05/add-in-wizards-for-revit-2015.html

Why doesn't my C++ addin build?

-   You may be missing the `<TargetFrameworkVersion>v4.5.2</TargetFrameworkVersion>` node in the `<PropertyGroup Label="Globals">` section of your .vcxproj file -- the Visual C++ default framework without this node is .NET 4.0.

Why doesn't my external command show up?

-   There is a variety of reasons. Is your .addin manifest file properly installed to C:\\ProgramData\\Autodesk\\Revit\\Addins\\ 20xx? Is the path to your DLL in the .addin correct?

Why isn't my application's OnStartup method called when Revit starts?

-   Check the .addin manifest from the question above. Also, try checking to see if an exception is called in the constructor of your addin object when Revit starts.

## API Usage

How do I reference an element in Revit?

-   Each element has an ID. The ID that is unique in the model is used to make sure that you are referring to the same element across multiple sessions of Revit.

Can a model only use one shared parameter file?

-   Shared parameter files are used to hold bits of information about the parameter. The most important piece of information is the GUID (Globally Unique Identifier) that is used to insure the uniqueness of a parameter in a single file and across multiple models.

    Revit can work with multiple shared parameter files but you can only read parameters from one file at a time. It is then up to you to choose the same shared parameter file for all models or a different one for each model.

    In addition, your API application should avoid interfering with the user's parameter file. Ship your application with its own parameter file containing your parameters. To load the parameter(s) into a Revit file:

    -   The application must remember the user parameter file name.
    -   Switch to the application's parameter file and load the parameter.
    -   Then switch back to the user's file.

Do I need to distribute the shared parameters file with the model so other programs can use the shared parameters?

-   No. The shared parameters file is only used to load shared parameters. After they are loaded the file is no longer needed for that model.

Are shared parameter values copied when the corresponding element is copied?

-   Yes. If you have a shared parameter that holds the unique ID for an element in your database, append the Revit element Unique ID or add another shared parameter with the Revit element unique ID. Do this so that you can check it and make sure you are working with the original element ID and not a copy.

Are element Unique IDs (UID) universally unique and can they ever change?

-   The element UIDs are not universally unique but they are unique within a model as are element IDs. They are not universally unique since they can be duplicated when creating one document by copying another. However, UniqueIDs are stable for referencing elements in a worksharing environment because they will not change. Unlike UniqueIDs, regular IDs can be renumbered when synching with a central model, therefore they cannot be considered stable for referencing of elements.

Revit takes a long time to update when my application sends data back to the model. What do I need to do to speed it up?

-   Make sure you only call Document.Regenerate() as often as necessary. Although this method is required to make sure the elements in the Revit document reflect all changes, it can slow down your application. Keep in mind, too, that when a transaction is committed there is an automatic call to regenerate the document.

What do I do if I want to add shared parameters to elements that do not have the ability to have shared parameters bound to them? For example, Grids or Materials.

-   If an element type does not have the ability to add shared parameters, you need to add a project parameter. This does make it a bit more complicated when it is time to access the shared parameter associated with the element because it does not show up as part of the element's parameter list. By using tricks like making the project shared parameter a string and including the element ID in the shared parameter you can associate the data with an element by first parsing the string.

How do I access the saved models and content BMP?

-   The Preview.dll is a shell plug-in which is an object that implements the IExtractImage interface. IExtractImage is an interface used by the Windows Shell Folders to extract the images for a known file type.

    For more information, review the information at Revit API Developers Guide for Autodesk Revit.").

    CRevitPreviewExtractor implements standard API functions:

```
STDMETHOD(GetLocation)(LPWSTR pszPathBuffer,
        DWORD cchMax,
        DWORD *pdwPriority,
        const SIZE *prgSize,
        DWORD dwRecClrDepth,
        DWORD *pdwFlags);
        STDMETHOD(Extract)(HBITMAP*);
```

It registers itself in the registry.

Why is Element.Parameters taking so long to access?

-   This property executes many calculations internally. Caching specific properties in a separate data structure may be a good idea, depending on your applications' needs.

## Structural Engineering

Sometimes the default end releases of structural elements render the model unstable. How can I deal with this situation?

-   The Analytical Model Check feature introduced in Revit Structure R3 can find some of these issues. When importing the analytical model, you are asked if you want to retain the release conditions from RST (Revit Structure) or if you want to set all beams and columns to fixed. When re-importing the model to RST, always update the end releases and do not overwrite the end releases on subsequent export to analysis programs.

I am rotating the beam orientation so they are rotated in the weak direction. For example, the I of a W14X30 is rotated to look like an H by a 90 degree rotation. How is that rotation angle accessed in the API? Because the location is a LocationCurve not a LocationPoint I do not have access to the Rotation value so what is it I need to check? I have a FamilyInstance element to check so what do I do with it?

-   Take a look at the RotateFramingObject example in the SDK. It has examples of how to get and change the beam braces and columns rotation angle.

How do I add new concrete beam and column sizes to a model?

-   Take a look at the FrameBuilder sample code in the SDK

How do I view the true deck layer?

-   There is an example in the SDK called DeckProperties that provides information about how to get the layer information for the deck. The deck information is reported in exactly the same way as it is in the UI. The deck dimension parameters are shown as follows.

How do I tell when I have a beam with a cantilever?

-   There is no direct way in the Revit database to tell if a beam has a cantilever. However, one or more of the following options can give you a good guess at whether a section is a cantilever:

    There are two parameters called Moment Connection Start and Moment Connection End. If the value set for these two is not None then you should look and see if there is a beam that is co-linear and also has the value set to something other than None. Also ask the user to make sure to select Cantilever Moment option rather than Moment Frame option.

    Trace the connectivity back beyond the element approximately one or two elements.

    Look at element release conditions.

When exporting a model containing groups to an external program, the user receives the following error at the end of the export: "Changes to group "Group 1" are allowed only in group edit mode. Use the Edit Group command to make the change to all instances of the group. You may use the "Ungroup" option to proceed with this change by ungrouping the changed group instances."

-   Currently the API does not permit changes to group members. You can programmatically ungroup, make the change, regroup and then swap the other instances of the old group to the new group to get the same effect.

## General

Is the API binary compatible between major releases?

-   Partially. Any API marked obsolete will be supported for that release and removed in the following release. Therefore, your application must be up to date with the latest APIs at least every other release to remain compatible.

---